OpenFOAM_Examples/Quasi_DNS_Dowtherm_Mixed_Conv/DNSCase1/constant/constant.ref/sphere/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       polynomial;
    thermo          hPolynomial;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
// this is for pure copper
    specie
    {
        molWeight   63.546;
    }

    transport
    {
        // valid from -23C to 327C

        muCoeffs<8>     ( 0 0 0 0 0 0 0 0 );
        kappaCoeffs<8>  ( 4.5425094315E+02 -2.9125066852E-01 4.7729066389E-04 -3.3490886490E-07 0 0 0 0 );
    }
    thermodynamics
    {
        Hf              0;
        Sf              0;
        CpCoeffs<8>     ( 1.8658483803E+02 1.4920474673E+00 -4.1752372544E-03 5.5111636355E-06 -2.7194694879E-09 0 0 0 );

    // valid from -23C to 327C
    }
    equationOfState
    {
        rho     8960;
    }
}

// ************************************************************************* //
